org/page/index.org
#+OPTIONS:   H:4 num:nil toc:nil author:nil timestamp:nil tex:t 
#+BEGIN_HTML
---
layout: default
title: Home
---
#+END_HTML

* Biography

Yilin Mo is an Assistant Professor in the School of Electrical and Electronic Engineering at Nanyang Technological University. He received his Ph.D. In Electrical and Computer Engineering from Carnegie Mellon University in 2012 and his Bachelor of Engineering degree from Department of Automation, Tsinghua University in 2007. Prior to his current position, he was a postdoctoral scholar at Carnegie Mellon University in 2013 and California Institute of Technology from 2013 to 2015.

* Research Interest
** Networked Control Systems
** Detection, Estimation and Control in Adversarial Environment

* Contact

*Yilin Mo*

Assistant Professor

[[http://www.eee.ntu.edu.sg/Pages/Home.aspx][School of Electrical and Electronic Engineering]]\\
[[http://www.ntu.edu.sg/Pages/home.aspx][Nanyang Technological University]]\\
Building S1, Room B1c-104\\
50 Nanyang Avenue, Singapore 639798\\
Tel: (+65) 6790 4551\\
E-mail: [[mailto:ylmo@ntu.edu.sg][ylmo@ntu.edu.sg]]
