index.html
---
layout: default
title: Home
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Biography</h2>
<div class="outline-text-2" id="text-1">
<p>
Yilin Mo is an Assistant Professor in the School of Electrical and Electronic Engineering at Nanyang Technological University. He received his Ph.D. In Electrical and Computer Engineering from Carnegie Mellon University in 2012 and his Bachelor of Engineering degree from Department of Automation, Tsinghua University in 2007. Prior to his current position, he was a postdoctoral scholar at Carnegie Mellon University in 2013 and California Institute of Technology from 2013 to 2015.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Research Interest</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Networked Control Systems</h3>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Detection, Estimation and Control in Adversarial Environment</h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Contact</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Yilin Mo</b>
</p>

<p>
Assistant Professor
</p>

<p>
<a href="http://www.eee.ntu.edu.sg/Pages/Home.aspx">School of Electrical and Electronic Engineering</a><br  />
<a href="http://www.ntu.edu.sg/Pages/home.aspx">Nanyang Technological University</a><br  />
Building S1, Room B1c-104<br  />
50 Nanyang Avenue, Singapore 639798<br  />
Tel: (+65) 6790 4551<br  />
E-mail: <a href="mailto:ylmo@ntu.edu.sg">ylmo@ntu.edu.sg</a>
</p>
</div>
</div>
